#include "ui.h"
/*
 *
 *
 *
 */
 
 
void LoginUI(){
	system("clear");
	printf("=============  AHUT Linux 兴趣小组  ===============\n");
	printf("\n");
	printf("============    组长：王朱辉        ===============\n");
	printf("\n");
	printf("============组员：唐立飞 汪志刚 李昂===============\n");
	printf("\n");
	printf("============    指导老师： 郭玉华   ===============\n");
	printf("\n");
	printf("                   开始登录                    \n");
	printf("\n");
	printf("please input name:\n");
	return ;
}



void MainUI(){
	system("clear");
	printf("##########################################################################\n");
	printf("+++++++++++++++++++++++++++  欢迎进入聊天系统   ++++++++++++++++++++++++++\n");
	printf("@                                                                        @\n");
	printf("@               1. 私聊                  2. 群聊                         @\n");
	printf("@                                                                        @\n");
	printf("@               3. 加入群组              4.查看在线	                 @\n");
	printf("@                                                                        @\n");
	printf("@               5. 发送离线消息		 6. 接收离线消息                 @\n");
	printf("@                                                                        @\n");
	printf("@                               0. 退出                                  @\n");
	printf("@                                                                        @\n");
	printf("##########################################################################\n");
	printf("您的选择:");
	
}



